Project/Toir/src/Documents/торо_УстановкаКоэффициентовРемонтныхОсобенностей/торо_УстановкаКоэффициентовРемонтныхОсобенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаКоэффициентовРемонтныхОсобенностей</name>
  <registerRecords>InformationRegister.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоэффициентыРемонтныхОсобенностей</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаИспользования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоэффициентыРемонтныхОсобенностейПодчиненных</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаИспользования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ЗначенияКоэффициентовРемонтныхОсобенностей/торо_ЗначенияКоэффициентовРемонтныхОсобенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКоэффициентовРемонтныхОсобенностей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеКоэффициента</name>
    <type>
      <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
    </type>
  </resources>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКоэффициента</name>
    <type>
      <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_УстановкаКоэффициентовРемонтныхОсобенностей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если КоэффициентыРемонтныхОсобенностей.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En el documento no es rellenada la parte tabular de los coeficientes de los rasgos de reparación. ¡La realización es imposible!';ru='В документе не заполнена табличная часть коэффициентов ремонтных особенностей. Проведение невозможно!';en='The document does not fill out the tabular part of the coefficients of repair features. Conducting is impossible!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;	
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = Строка(Ссылка);
	
	Если НЕ Константы.торо_ИспользоватьКоэффициентыРемонтныхОсобенностей.Получить() Тогда
		ТекстСообщения = НСтр("es='La realización es imposible. Es desconectado el ajuste ""Usar los coeficientes de los rasgos de reparación"" (el Ajuste y la administración-> el Panel de la administración ТОиР).';ru='Проведение невозможно. Отключена настройка ""Использовать коэффициенты ремонтных особенностей"" (Настройка и администрирование -> Панель администрирования ТОиР).';en='Carrying out is impossible. The ""Use repair features coefficients"" setting is disabled (Setup and administration -> MRO administration bar).'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ВидКоэффициента КАК ВидКоэффициента,
	|	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ОбъектРемонта КАК ОбъектРемонта,
	|	НАЧАЛОПЕРИОДА(торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ДатаНачалаИспользования, ДЕНЬ) КАК Период
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	Документ.торо_УстановкаКоэффициентовРемонтныхОсобенностей.КоэффициентыРемонтныхОсобенностей КАК торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей
	|ГДЕ
	|	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	ВидКоэффициента,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Период, ДЕНЬ) КАК Период,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.ВидКоэффициента КАК ВидКоэффициента,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.ОбъектРемонта КАК ОбъектРемонта
	|ПОМЕСТИТЬ Регистр
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКоэффициентовРемонтныхОсобенностей КАК торо_ЗначенияКоэффициентовРемонтныхОсобенностей
	|ГДЕ
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Регистратор <> &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	ВидКоэффициента,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧ.ОбъектРемонта,
	|	ДокТЧ.ВидКоэффициента,
	|	ДокТЧ.Период
	|ИЗ
	|	ДокТЧ КАК ДокТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистр КАК Регистр
	|		ПО ДокТЧ.ОбъектРемонта = Регистр.ОбъектРемонта
	|			И ДокТЧ.ВидКоэффициента = Регистр.ВидКоэффициента
	|			И ДокТЧ.Период = Регистр.Период";
			 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	резЗапроса = Запрос.Выполнить();
	Если Не резЗапроса.Пустой() Тогда
		
		ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" a la fecha de ""%2"" es determinado ya el tipo del coeficiente ""%3"".';ru='Для объекта ремонта ""%1"" на дату ""%2"" уже определен вид коэффициента ""%3"".';en='The coefficient type ""%3"" has already been determined for the repair object ""%1"" at the date ""%2"".'");
		
		Выборка = резЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектРемонта, Формат(Выборка.Период, "ДФ=dd.MM.yyyy"), Выборка.ВидКоэффициента);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Для Каждого ТекСтрокаТЧ Из КоэффициентыРемонтныхОсобенностей Цикл
			
			Движение = Движения.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Добавить();
			
			Движение.Период = ТекСтрокаТЧ.ДатаНачалаИспользования;
			Движение.ОбъектРемонта = ТекСтрокаТЧ.ОбъектРемонта;
			Движение.ВидКоэффициента = ТекСтрокаТЧ.ВидКоэффициента;
			Движение.ЗначениеКоэффициента = ТекСтрокаТЧ.ЗначениеКоэффициента;
			Движение.Использование = ТекСтрокаТЧ.Использование;
		КонецЦикла;
		
		// для подчиненных	
		Для каждого Коэффициент Из КоэффициентыРемонтныхОсобенностей Цикл
			
			Если Коэффициент.РаспространятьНаПодчиненных Тогда
				МассивПодчиненных = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(Коэффициент.ОбъектРемонта, Коэффициент.Иерархия);
				Для каждого ОбъектРемонта Из МассивПодчиненных Цикл
					Движение = Движения.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Добавить();
					
					Движение.Период = Коэффициент.ДатаНачалаИспользования;
					Движение.ОбъектРемонта = ОбъектРемонта;
					Движение.ВидКоэффициента = Коэффициент.ВидКоэффициента;
					Движение.ЗначениеКоэффициента = Коэффициент.ЗначениеКоэффициента;
					Движение.Использование = Коэффициент.Использование;				
				КонецЦикла; 
			КонецЕсли; 
		КонецЦикла; 
				
		Движения.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
